force_backward:true
layer {
  name: "dataLayer"
  type: "HDF5Data"
  top: "target"
  top: "neighbor0"
  top: "neighbor1"
  top: "neighbor2"
  top: "neighbor3"
  top: "neighbor4"
  top: "neighbor5"
  top: "negative"
  hdf5_data_param {
    source: "/cs/vml3/mkhodaba/cvpr16/code/embedding_segmentation/dataset/datalist.txt"
    batch_size: 2566
  }
}
layer {
  name: "inner_product_target"
  type: "InnerProduct"
  bottom: "target"
  top: "inner_product_target"
  param {
    name: "embed_w1"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "embed_b1"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 768
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "xavier"
      value: 0.2
    }
  }
}
layer {
  name: "inner_product_negative"
  type: "InnerProduct"
  bottom: "negative"
  top: "inner_product_negative"
  param {
    name: "embed_w1"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "embed_b1"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 768
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "xavier"
      value: 0.2
    }
  }
}
layer {
  name: "inner_product_neighbor0"
  type: "InnerProduct"
  bottom: "neighbor0"
  top: "inner_product_neighbor0"
  param {
    name: "embed_w1"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "embed_b1"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 768
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "xavier"
      value: 0.2
    }
  }
}
layer {
  name: "inner_product_neighbor1"
  type: "InnerProduct"
  bottom: "neighbor1"
  top: "inner_product_neighbor1"
  param {
    name: "embed_w1"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "embed_b1"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 768
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "xavier"
      value: 0.2
    }
  }
}
layer {
  name: "inner_product_neighbor2"
  type: "InnerProduct"
  bottom: "neighbor2"
  top: "inner_product_neighbor2"
  param {
    name: "embed_w1"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "embed_b1"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 768
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "xavier"
      value: 0.2
    }
  }
}
layer {
  name: "inner_product_neighbor3"
  type: "InnerProduct"
  bottom: "neighbor3"
  top: "inner_product_neighbor3"
  param {
    name: "embed_w1"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "embed_b1"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 768
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "xavier"
      value: 0.2
    }
  }
}
layer {
  name: "inner_product_neighbor4"
  type: "InnerProduct"
  bottom: "neighbor4"
  top: "inner_product_neighbor4"
  param {
    name: "embed_w1"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "embed_b1"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 768
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "xavier"
      value: 0.2
    }
  }
}
layer {
  name: "inner_product_neighbor5"
  type: "InnerProduct"
  bottom: "neighbor5"
  top: "inner_product_neighbor5"
  param {
    name: "embed_w1"
    lr_mult: 1
    decay_mult: 1
  }
  param {
    name: "embed_b1"
    lr_mult: 2
    decay_mult: 0
  }
  inner_product_param {
    num_output: 768
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "xavier"
      value: 0.2
    }
  }
}
layer {
  name: "relu_target"
  type: "ReLU"
  bottom: "inner_product_target"
  top: "inner_product_target"
}
layer {
  name: "relu_negative"
  type: "ReLU"
  bottom: "inner_product_negative"
  top: "inner_product_negative"
}
layer {
  name: "relu_neighbor0"
  type: "ReLU"
  bottom: "inner_product_neighbor0"
  top: "inner_product_neighbor0"
}
layer {
  name: "relu_neighbor1"
  type: "ReLU"
  bottom: "inner_product_neighbor1"
  top: "inner_product_neighbor1"
}
layer {
  name: "relu_neighbor2"
  type: "ReLU"
  bottom: "inner_product_neighbor2"
  top: "inner_product_neighbor2"
}
layer {
  name: "relu_neighbor3"
  type: "ReLU"
  bottom: "inner_product_neighbor3"
  top: "inner_product_neighbor3"
}
layer {
  name: "relu_neighbor4"
  type: "ReLU"
  bottom: "inner_product_neighbor4"
  top: "inner_product_neighbor4"
}
layer {
  name: "relu_neighbor5"
  type: "ReLU"
  bottom: "inner_product_neighbor5"
  top: "inner_product_neighbor5"
}
layer {
  name: "context_sum"
  type: "Eltwise"
  bottom: "inner_product_neighbor0"
  bottom: "inner_product_neighbor1"
  bottom: "inner_product_neighbor2"
  bottom: "inner_product_neighbor3"
  bottom: "inner_product_neighbor4"
  bottom: "inner_product_neighbor5"
  top: "context_sum"
  eltwise_param {
    operation: SUM
    coeff: 0.166666666667
    coeff: 0.166666666667
    coeff: 0.166666666667
    coeff: 0.166666666667
    coeff: 0.166666666667
    coeff: 0.166666666667
  }
}
layer {
  name: "target_negative_diff"
  type: "Eltwise"
  bottom: "inner_product_target"
  bottom: "inner_product_negative"
  top: "target_negative_diff"
  eltwise_param {
    operation: SUM
    coeff: 1
    coeff: -1
  }
}
layer {
  name: "loss"
  type: "Python"
  bottom: "context_sum"
  bottom: "target_negative_diff"
  top: "loss"
  python_param {
    module: "my_dot_product_layer"
    layer: "MyHingLossDotProductLayer"
  }
}
